<a href="https://colab.research.google.com/github/theheking/intro-to-python/blob/gh-pages/5_Combining_DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Learning How to Combine DataFrames
A common problem when dealing with is data is when you want combine two or more dataframes into one larger, more representative one.  Here we will learn how to both concatenate or merge two datasets using pandas.

In [ ]:
#make sure that libraries are currectly installed
!pip install pandas matplotlib

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: pandas in /usr/local/lib/python3.9/dist-packages (1.4.4)
Requirement already satisfied: matplotlib in /usr/local/lib/python3.9/dist-packages (3.7.1)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.9/dist-packages (from pandas) (2022.7.1)
Requirement already satisfied: python-dateutil>=2.8.1 in /usr/local/lib/python3.9/dist-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.18.5 in /usr/local/lib/python3.9/dist-packages (from pandas) (1.22.4)
Requirement already satisfied: cycler>=0.10 in /usr/local/lib/python3.9/dist-packages (from matplotlib) (0.11.0)
Requirement already satisfied: pyparsing>=2.3.1 in /usr/local/lib/python3.9/dist-packages (from matplotlib) (3.0.9)
Requirement already satisfied: pillow>=6.2.0 in /usr/local/lib/python3.9/dist-packages (from matplotlib) (8.4.0)
Requirement already satisfied: importlib-resources>=3.2.0 in /usr/local/lib/python3.9/dist-packages (from matplotlib) (5.12.0)
Requirement already satisfied: kiwisolver>=1.0.1 in /usr/local/lib/python3.9/dist-packages (from matplotlib) (1.4.4)
Requirement already satisfied: fonttools>=4.22.0 in /usr/local/lib/python3.9/dist-packages (from matplotlib) (4.39.3)
Requirement already satisfied: contourpy>=1.0.1 in /usr/local/lib/python3.9/dist-packages (from matplotlib) (1.0.7)
Requirement already satisfied: packaging>=20.0 in /usr/local/lib/python3.9/dist-packages (from matplotlib) (23.0)
Requirement already satisfied: zipp>=3.1.0 in /usr/local/lib/python3.9/dist-packages (from importlib-resources>=3.2.0->matplotlib) (3.15.0)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.9/dist-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [ ]:
import pandas as pd
import urllib.request

In [ ]:
url = 'https://ucsbcarpentry.github.io/truncated-python-ecology-lesson/data/yearly_files/surveys2001.csv'
urllib.request.urlretrieve(url, 'surveys2001.csv')
surveys_df = pd.read_csv("surveys2001.csv", keep_default_na=False, na_values=[""],index_col=0)

In [ ]:
# read in first 10 lines of surveys table
survey_sub = surveys_df.head(10)
# take the last 10 rows
survey_sub_last10 = surveys_df.tail(10)
# reset the index values- otherwise the the second dataframe will not append properly
# the flag, drop=True option avoids adding new index column with old index values
survey_sub_last10=survey_sub_last10.reset_index(drop=True)

There are two options for the axis flag.

- axis=0, detects same column names and stacks dataframes on top of one another
- axis=1, stacks the columns beside one another

In [ ]:
# stack the DataFrames on top of each other
vertical_stack = pd.concat([survey_sub, survey_sub_last10], axis=0)

# place the DataFrames side by side
horizontal_stack = pd.concat([survey_sub, survey_sub_last10], axis=1)

In [ ]:
#read in the second dataframe surverys 2002
url ='https://ucsbcarpentry.github.io/truncated-python-ecology-lesson/data/yearly_files/surveys2002.csv'
urllib.request.urlretrieve(url, 'surveys2002.csv')
surveys_df2 = pd.read_csv("surveys2002.csv", keep_default_na=False, na_values=[""], index_col=0)

In [ ]:
#print off the survey
surveys_df2

,record_id,month,day,year,site_id,species_id,sex,hindfoot_length,weight
33320,33321,1,12,2002,1,DM,M,38.0,44.0
33321,33322,1,12,2002,1,DO,M,37.0,58.0
33322,33323,1,12,2002,1,PB,M,28.0,45.0
33324,33325,1,12,2002,1,DO,M,35.0,29.0
33325,33326,1,12,2002,2,OT,F,20.0,26.0
...,...,...,...,...,...,...,...,...,...
35540,35541,12,31,2002,15,PB,F,24.0,31.0
35541,35542,12,31,2002,15,PB,F,26.0,29.0
35542,35543,12,31,2002,15,PB,F,27.0,34.0
35546,35547,12,31,2002,10,RM,F,15.0,14.0
35547,35548,12,31,2002,7,DO,M,36.0,51.0

In [ ]:
#get the last ten 
survey_sub2_last10 = surveys_df2.tail(10)

In [ ]:
# Stack the DataFrames on top of each other
vertical_stack2 = pd.concat([surveys_df, surveys_df2], axis=0)

# Place the DataFrames side by side
horizontal_stack2 = pd.concat([surveys_df, surveys_df2], axis=1)

In [ ]:
#find the mean year for each sex 
vertical_stack2.groupby('sex')['year'].mean()

sex
F    2001.611141
M    2001.570054
Name: year, dtype: float64

In [ ]:
#save your vertical stack 
vertical_stack2.to_csv('vertical.csv')

# Joining DataFrames

- We concatenated our DataFrames we simply added them to each other - stacking them either vertically or side by side

- We need to join the rows that are the same across both dataframes. 

- Combining DataFrames using a common field is called “joining”. 

- The columns containing the common values are called “join key(s)”. 

- Joining DataFrames in this way is often useful when one DataFrame is a “lookup table” containing additional data that we want to include in the other.

- For example, the species.csv file that we’ve been working with is a lookup table. It contains the genus, species and taxa code for 55 species, which is unique.

Storing data in this way has many benefits including:

- consistency
- easy for us to make changes to the species information once without having to find each instance of it in the larger survey data.
- optimizes the size of our data.



# Joining Two DataFrames

To better understand joins, let’s grab the first 10 lines of our data as a subset to work with

In [ ]:
# Read in first 10 lines of surveys table
survey_sub = surveys_df.head(10)
survey_sub

,record_id,month,day,year,site_id,species_id,sex,hindfoot_length,weight
31710,31711,1,21,2001,1,PB,F,26.0,25.0
31711,31712,1,21,2001,1,DM,M,37.0,43.0
31712,31713,1,21,2001,1,PB,M,29.0,44.0
31713,31714,1,21,2001,1,DO,M,34.0,53.0
31714,31715,1,21,2001,2,OT,M,20.0,27.0
31715,31716,1,21,2001,2,RM,M,17.0,11.0
31716,31717,1,21,2001,2,NL,M,33.0,121.0
31717,31718,1,21,2001,2,DM,F,34.0,44.0
31718,31719,1,21,2001,2,PB,M,26.0,42.0
31719,31720,1,21,2001,2,PB,M,27.0,41.0

In [ ]:
### Download speciesSubset.csv file from web
import urllib.request
url = 'https://bit.ly/2DfqN6C'
urllib.request.urlretrieve(url, 'speciesSubset.csv')

# import a small subset of the species data designed for this part of the lesson
# stored in the data folder.
species_sub = pd.read_csv('speciesSubset.csv', keep_default_na=False, na_values=[""])
species_sub

  species_id       genus   species    taxa
0         DM   Dipodomys  merriami  Rodent
1         NL     Neotoma  albigula  Rodent
2         PE  Peromyscus  eremicus  Rodent

In [ ]:
#check what columns are the same across both dataframe
print(species_sub.columns)
# check the column
print(surveys_df.columns)

Index(['species_id', 'genus', 'species', 'taxa'], dtype='object')
Index(['record_id', 'month', 'day', 'year', 'site_id', 'species_id', 'sex',
       'hindfoot_length', 'weight'],
      dtype='object')

In this example, species_sub is the lookup table containing genus, species, and taxa names.

We want to join the data that contains all of the columns from both species_df and survey_df. The column that is the same in both dataframes is species_id.

There are different type of joins! 


### A) Inner Join
- An inner join combines two DataFrames based on a join key and returns a new DataFrame that contains only those rows that have matching values in both of the original DataFrames.

- Inner joins yield a DataFrame that contains only rows where the value being joins exists in BOTH tables. 

An example of an inner join:
![img.png](https://drive.google.com/uc?id=1ZnVWxcmrXe4TySISayoLgShMS_UjCfbf)

In [ ]:
#choose the dataframe for the left, dataframe for the right
merged_inner = pd.merge(left=survey_sub, 
                        right=species_sub, 
                        left_on='species_id', 
                        right_on='species_id')
# this case `species_id` is the only column name in  both dataframes, so if we skipped `left_on`
# `right_on` arguments we would still get the same result

,record_id,month,day,year,site_id,species_id,sex,hindfoot_length,weight,genus,species,taxa
0,31712,1,21,2001,1,DM,M,37.0,43.0,Dipodomys,merriami,Rodent
1,31718,1,21,2001,2,DM,F,34.0,44.0,Dipodomys,merriami,Rodent
2,31717,1,21,2001,2,NL,M,33.0,121.0,Neotoma,albigula,Rodent

In [ ]:
# What's the size of the output data if you use the entire survey_df 
merged_inner = pd.merge(left=surveys_df, 
                        right=species_sub, 
                        left_on='species_id', 
                        right_on='species_id')
print(merged_inner.shape)
print(merged_inner)

(371, 12)
     record_id  month  day  year  site_id species_id sex  hindfoot_length  \
0        31712      1   21  2001        1         DM   M             37.0
1        31718      1   21  2001        2         DM   F             34.0
2        31723      1   21  2001       12         DM   F             37.0
3        31725      1   21  2001       12         DM   M             36.0
4        31731      1   21  2001       17         DM   M             37.0
..         ...    ...  ...   ...      ...        ...  ..              ...
366      33249     12   15  2001       19         PE   F             20.0
367      33291     12   15  2001       23         PE   M             20.0
368      33293     12   15  2001       20         PE   F             20.0
369      33302     12   15  2001       24         PE   M             20.0
370      33303     12   15  2001       24         PE   M             20.0

     weight       genus   species    taxa
0      43.0   Dipodomys  merriami  Rodent
1      44.0   Dipodomys  merriami  Rodent
2      49.0   Dipodomys  merriami  Rodent
3      43.0   Dipodomys  merriami  Rodent
4      49.0   Dipodomys  merriami  Rodent
..      ...         ...       ...     ...
366    14.0  Peromyscus  eremicus  Rodent
367    18.0  Peromyscus  eremicus  Rodent
368    22.0  Peromyscus  eremicus  Rodent
369    24.0  Peromyscus  eremicus  Rodent
370    23.0  Peromyscus  eremicus  Rodent

[371 rows x 12 columns]


> Note: that merged_inner has fewer rows than survey_sub. This is an indication that there were rows in surveys_df with value(s) for species_id that do not exist as value(s) for species_id in species_df.

# Left Joins

What if we want to add information from species_sub to survey_sub without losing any of the information from survey_sub? In this case, we use a different type of join called a “left outer join”, or a “left join”.

The result DataFrame from a left join looks similar to the result DataFrame from an inner join in terms of the columns it contains. However, unlike merged_inner, merged_left contains the same number of rows as the original survey_sub DataFrame.

> Note: a left join will still discard rows from the right DataFrame that do not have values for the join key(s) in the left DataFrame.

In [ ]:
#left join is performed in pandas by calling
#the same `merge` function used for inner join, but using the how='left' argument:
merged_left = pd.merge(left=surveys_df,
                       right=species_sub, 
                       how='left', 
                       left_on='species_id', 
                       right_on='species_id')
merged_left

,record_id,month,day,year,site_id,species_id,sex,hindfoot_length,weight,genus,species,taxa
0,31711,1,21,2001,1,PB,F,26.0,25.0,NaN,NaN,NaN
1,31712,1,21,2001,1,DM,M,37.0,43.0,Dipodomys,merriami,Rodent
2,31713,1,21,2001,1,PB,M,29.0,44.0,NaN,NaN,NaN
3,31714,1,21,2001,1,DO,M,34.0,53.0,NaN,NaN,NaN
4,31715,1,21,2001,2,OT,M,20.0,27.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
1429,33304,12,15,2001,24,RM,M,16.0,10.0,NaN,NaN,NaN
1430,33305,12,15,2001,7,PB,M,29.0,44.0,NaN,NaN,NaN
1431,33306,12,15,2001,7,OT,M,19.0,21.0,NaN,NaN,NaN
1432,33307,12,15,2001,7,OT,M,20.0,19.0,NaN,NaN,NaN
1433,33308,12,15,2001,7,PP,M,24.0,16.0,NaN,NaN,NaN

In [ ]:
#look at all the rows with null
merged_left[ pd.isnull(merged_left.genus) ]

,record_id,month,day,year,site_id,species_id,sex,hindfoot_length,weight,genus,species,taxa
0,31711,1,21,2001,1,PB,F,26.0,25.0,NaN,NaN,NaN
2,31713,1,21,2001,1,PB,M,29.0,44.0,NaN,NaN,NaN
3,31714,1,21,2001,1,DO,M,34.0,53.0,NaN,NaN,NaN
4,31715,1,21,2001,2,OT,M,20.0,27.0,NaN,NaN,NaN
5,31716,1,21,2001,2,RM,M,17.0,11.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
1429,33304,12,15,2001,24,RM,M,16.0,10.0,NaN,NaN,NaN
1430,33305,12,15,2001,7,PB,M,29.0,44.0,NaN,NaN,NaN
1431,33306,12,15,2001,7,OT,M,19.0,21.0,NaN,NaN,NaN
1432,33307,12,15,2001,7,OT,M,20.0,19.0,NaN,NaN,NaN
1433,33308,12,15,2001,7,PP,M,24.0,16.0,NaN,NaN,NaN

These rows are the ones where the value of species_id from survey_sub (in this case, PF) does not occur in species_sub.

# Other join types

The `pandas` merge function supports two other join types:

- Right (outer) join: Invoked by passing how='right' as an argument. Similar to a left join, except all rows from the right DataFrame are kept, while rows from the left DataFrame without matching join key(s) values are discarded.
- Full (outer) join: Invoked by passing how='outer' as an argument. This join type returns the all pairwise combinations of rows from both DataFrames; i.e., the result DataFrame will NaN where data is missing in one of the dataframes. This join type is very rarely used.

# Extra Challenge

1. Create a new DataFrame by containing the individual organisms from `surveys2002.csv` that are the species found in `speciesSubset.csv`.

2. Calculate the mean hindfoot_length by sex.